namespace Club.Domain.Entities.Rewards;

/// <summary>
/// می خواهیم بگوییم هزینه یک پاداش چند امتیاز است
/// در صورتیکه سطح‌امتیاز شما یک مقدار خاصی باشد می توان هزینه را کم کرد
/// برای این منظور فیلد سطح‌امتیاز را مقدار می دهیم در صورتیکه کاربر سطح مساوی یا بالاتری نسبت به این سطح داشته باشد
/// این رکورد برای هزینه اش در نظر گرفته می شود
/// قاعدتا دیتا به نوعی پر و تنظیم می شود که 
/// اگر برای سطوح متفاوت قیمت های متفاوت داشته باشیم هر چه سطح بالاتر بره قیمت کمتر می شود
/// </summary>
[DisplayName("هزینه پاداش")]
[SBVR(SBVRModality.Obligatory, "مدیریت قیمت‌گذاری پاداش‌ها", "هر پاداش باید برای هر سطح امتیاز یک قیمت مشخص داشته باشد تا قیمت‌گذاری پویا امکان‌پذیر باشد")]
[SBVR(SBVRModality.Recommended, "مدیریت قیمت‌گذاری پاداش‌ها", "هزینه پاداش برای تشویق وفاداری و انگیزه ارتقای سطح مشتریان با اعطای تخفیف به مشتریان با سطح بالاتر استفاده می‌شود")]
[SBVR(SBVRModality.Calculated, "مدیریت قیمت‌گذاری پاداش‌ها", "قیمت به صورت پویا بر اساس سطح امتیاز مشتری محاسبه می‌شود. اگر PointLevelId نال باشد، قیمت اصلی اعمال می‌شود. هر چه سطح امتیاز بالاتر رود، قیمت کمتر می‌شود")]
[OldDbMap("AwardCosts")]
public class RewardCost : ClubBaseCoreAuditableEntity<int>
{
    [OldDbMap("AwardId")]
    public int RewardId { get; set; }
    [DisplayName("پاداش")]
    [SBVR(SBVRModality.Obligatory, "رابطه پاداش-هزینه", "هر هزینه باید به یک پاداش مشخص تعلق داشته باشد تا مدیریت قیمت‌گذاری امکان‌پذیر باشد")]
    [SBVR(SBVRModality.Recommended, "رابطه پاداش-هزینه", "رابطه پاداش-هزینه برای محاسبه قیمت‌های پویا بر اساس سطح امتیاز مشتری استفاده می‌شود")]
    public Reward Reward { get; set; } = null!;

    public int PointId { get; set; }
    [DisplayName("امتیاز")]
    [SBVR(SBVRModality.Obligatory, "نوع امتیاز", "هر هزینه باید برای یک نوع امتیاز مشخص تعریف شود تا مدیریت چند ارزی امکان‌پذیر باشد")]
    [SBVR(SBVRModality.Recommended, "نوع امتیاز", "نوع امتیاز برای مدیریت چند ارزی و انعطاف‌پذیری سیستم امتیازدهی استفاده می‌شود")]
    public Point Point { get; set; } = null!;

    [DisplayName("مقدار")]
    [SBVR(SBVRModality.Obligatory, "قیمت پاداش", "مقدار قیمت برای محاسبه تعداد امتیازات مورد نیاز برای خرید پاداش ضروری است")]
    [SBVR(SBVRModality.Calculated, "قیمت پاداش", "مقدار بر اساس ارزش پاداش و سودآوری مورد انتظار محاسبه می‌شود")]
    public long Amount { get; set; }

    /// <summary>
    /// سطح‌امتیاز اگر این مقدار یا بیشتر باشد این هزینه اعمال می شود
    /// درواقع اگر مشتری این سطح‌امتیاز را داشته باشه از تخفیف این رکورد استفاده می کنه
    /// اگر نال باشد هزینه اصلی این پاداش است
    /// </summary>
    public int? PointLevelId { get; set; }
    [DisplayName("حداقل سطح‌امتیاز موردنیاز")]
    [SBVR(SBVRModality.Permitted, "تخفیف سطح امتیاز", "حداقل سطح امتیاز برای اعطای تخفیف به مشتریان با سطح امتیاز بالاتر استفاده می‌شود")]
    [SBVR(SBVRModality.Recommended, "تخفیف سطح امتیاز", "تخفیف سطح امتیاز برای تشویق وفاداری و افزایش انگیزه ارتقای سطح استفاده می‌شود")]
    public PointLevel? PointLevel { get; set; }
}
